tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_IOMUXC_GPR_GPR42_GPIO_MUX3_GPIO_SEL_LOW_MASK 0x18U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */
#define BOARD_INITPINS_IOMUXC_GPR_GPR43_GPIO_MUX3_GPIO_SEL_HIGH_MASK 0x8000U /*!< GPIO3 and CM7_GPIO3 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/* GPIO_AD_25 (coord M15), LPUART1_RXD/J32[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_RXD_SIGNAL                                    RXD   /*!< Signal name */

/* GPIO_AD_24 (coord L13), LPUART1_TXD/J31[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART1_TXD_SIGNAL                                    TXD   /*!< Signal name */

/* GPIO_LPSR_01 (coord R6), CAN3_RX/U42[4] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN3_RX_PERIPHERAL                                   CAN3   /*!< Peripheral name */
#define BOARD_INITPINS_CAN3_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_LPSR_00 (coord N6), CAN3_TX/U42[1] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN3_TX_PERIPHERAL                                   CAN3   /*!< Peripheral name */
#define BOARD_INITPINS_CAN3_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_AD_01 (coord R14), SIM1_CLK/J44[C3]/J57[7]/CTP_RST_B/J48[28]/J10[4]/J25[13] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_RX_PERIPHERAL                                   CAN2   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_AD_00 (coord N12), SIM1_TRXD/J44[C7]/J57[9]/CTP_INT/J48[29]/J25[15]/J9[14] */
/* Routed pin properties */
#define BOARD_INITPINS_CAN2_TX_PERIPHERAL                                   CAN2   /*!< Peripheral name */
#define BOARD_INITPINS_CAN2_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_AD_02 (coord R13), RS485_UART_TX / BLUETOOTH_UART_TX */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART8_TX_PERIPHERAL                             LPUART8   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART8_TX_SIGNAL                                     TXD   /*!< Signal name */

/* GPIO_AD_03 (coord P15), RS485_UART_RX / BLUETOOTH_UART_RX */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART8_RX_PERIPHERAL                             LPUART8   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART8_RX_SIGNAL                                     RXD   /*!< Signal name */

/* GPIO_LPSR_07 (coord R8), I2C6_SCL/J50[12] */
/* Routed pin properties */
#define BOARD_INITPINS_I2C6_SCL_PERIPHERAL                                LPI2C6   /*!< Peripheral name */
#define BOARD_INITPINS_I2C6_SCL_SIGNAL                                       SCL   /*!< Signal name */

/* GPIO_LPSR_06 (coord P8), I2C6_SDA/J50[11] */
/* Routed pin properties */
#define BOARD_INITPINS_I2C6_SDA_PERIPHERAL                                LPI2C6   /*!< Peripheral name */
#define BOARD_INITPINS_I2C6_SDA_SIGNAL                                       SDA   /*!< Signal name */

/* GPIO_DISP_B1_01 (coord D13), ENET_RGMII_RXC/U10[27] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_RX_CLK_PERIPHERAL                       ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_RX_CLK_SIGNAL                        enet_rx_clk   /*!< Signal name */

/* GPIO_DISP_B1_04 (coord E10), ENET_RGMII_RXD2/U10[23] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_RXD2_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_RXD2_SIGNAL                           enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_RXD2_CHANNEL                                  2U   /*!< Signal channel */

/* GPIO_DISP_B1_05 (coord C11), ENET_RGMII_RXD3/U10[22] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_RXD3_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_RXD3_SIGNAL                           enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_RXD3_CHANNEL                                  3U   /*!< Signal channel */

/* GPIO_DISP_B1_06 (coord D10), ENET_RGMII_TXD3/U10[15]/BT_CFG[0] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_TXD3_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_TXD3_SIGNAL                           enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_TXD3_CHANNEL                                  3U   /*!< Signal channel */

/* GPIO_DISP_B1_07 (coord E12), ENET_RGMII_TXD2/U10[16]/BT_CFG[1] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_TXD2_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_TXD2_SIGNAL                           enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_TXD2_CHANNEL                                  2U   /*!< Signal channel */

/* GPIO_EMC_B1_09 (coord A3), SEMC_A0/U13[23]/U25[23] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_A0_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_A0_SIGNAL                                       ADDR   /*!< Signal name */
#define BOARD_INITPINS_SEMC_A0_CHANNEL                                        0U   /*!< Signal channel */

