tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* GPIO_EMC_B1_27 (coord G5), SEMC_CKE/U13[37]/U25[37] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CKE_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CKE_SIGNAL                                  semc_cke   /*!< Signal name */

/* GPIO_EMC_B1_28 (coord E5), SEMC_WE/U13[16]/U25[16] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_WE_PERIPHERAL                                   SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_WE_SIGNAL                                    semc_we   /*!< Signal name */

/* GPIO_EMC_B1_37 (coord H1), SEMC_D15/U13[53] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_D15_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_D15_SIGNAL                                      DATA   /*!< Signal name */
#define BOARD_INITPINS_SEMC_D15_CHANNEL                                      15U   /*!< Signal channel */

/* GPIO_AD_31 (coord J17), LPSPI1_SDI/U27[2]/J10[10] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_SIN_PERIPHERAL                              LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_SIN_SIGNAL                                     SIN   /*!< Signal name */

/* GPIO_AD_30 (coord K17), LPSPI1_SDO/U27[5]/J10[8]/Backlight_CTL/J48[34]/U46[4] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_SOUT_PERIPHERAL                             LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_SOUT_SIGNAL                                   SOUT   /*!< Signal name */

/* GPIO_AD_08 (coord R15), USB_OTG2_ID/U20[3]/U18[A1]/J26[12]/J18[4] */
/* Routed pin properties */
#define BOARD_INITPINS_USB2_ID_PERIPHERAL                                   USB2   /*!< Peripheral name */
#define BOARD_INITPINS_USB2_ID_SIGNAL                                usb2_otg_id   /*!< Signal name */

/* GPIO_AD_06 (coord N13), USB_OTG2_OC/U18[A2]/J9[10]/AUD_INT */
/* Routed pin properties */
#define BOARD_INITPINS_USB2_OC_PERIPHERAL                                   USB2   /*!< Peripheral name */
#define BOARD_INITPINS_USB2_OC_SIGNAL                                usb_otg2_oc   /*!< Signal name */

/* GPIO_AD_07 (coord T17), USB_OTG2_PWR/WL_DEV_WAKE/U354[10]/J10[2] */
/* Routed pin properties */
#define BOARD_INITPINS_USB2_PWR_PERIPHERAL                                  USB2   /*!< Peripheral name */
#define BOARD_INITPINS_USB2_PWR_SIGNAL                              usb_otg2_pwr   /*!< Signal name */

/* GPIO_AD_09 (coord R16), USB_OTG1_ID/U28[3]/U26[A1]/J26[10]/J20[4] */
/* Routed pin properties */
#define BOARD_INITPINS_USB1_ID_PERIPHERAL                                   USB1   /*!< Peripheral name */
#define BOARD_INITPINS_USB1_ID_SIGNAL                                usb1_otg_id   /*!< Signal name */

/* GPIO_AD_11 (coord P16), USB_OTG1_OC/U26[A2]/J26[4] */
/* Routed pin properties */
#define BOARD_INITPINS_USB1_OC_PERIPHERAL                                   USB1   /*!< Peripheral name */
#define BOARD_INITPINS_USB1_OC_SIGNAL                                usb_otg1_oc   /*!< Signal name */

/* GPIO_EMC_B1_26 (coord J3), SEMC_CLK/U13[38]/U25[38] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CLK_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CLK_SIGNAL                                  semc_clk   /*!< Signal name */

/* GPIO_EMC_B1_29 (coord E6), SEMC_CS0/U13[19]/U25[19] */
/* Routed pin properties */
#define BOARD_INITPINS_SEMC_CS0_PERIPHERAL                                  SEMC   /*!< Peripheral name */
#define BOARD_INITPINS_SEMC_CS0_SIGNAL                                        CS   /*!< Signal name */
#define BOARD_INITPINS_SEMC_CS0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_SD_B2_05 (coord E14), FlexSPI_A_DQS/U21[C3] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC2_CMD_PERIPHERAL                             FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC2_CMD_SIGNAL                            FLEXSPI_A_DQS   /*!< Signal name */

/* GPIO_AD_34 (coord J16), 1588_EVENT0_IN/SD1_VSELECT */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC1_VSELECT_PERIPHERAL                           USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC1_VSELECT_SIGNAL                        usdhc_vselect   /*!< Signal name */

/* GPIO_SD_B1_00 (coord B16), SD1_CMD/J15[3]/WIFI_SDIO_CMD/J54[11]/NVCC_SD/U19G[D14] */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_CMD_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_CMD_SIGNAL                                  usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B1_01 (coord D15), SD1_CLK/J15[5]/WIFI_SDIO_CLK/J54[9] */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_CLK_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_CLK_SIGNAL                                  usdhc_clk   /*!< Signal name */

/* GPIO_SD_B1_02 (coord C15), SD1_D0/J15[7]/WIFI_SDIO_D0/J54[13]/NVCC_SD/U19G[D14] */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D0_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D0_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_SD_B1_03 (coord B17), SD1_D1/J15[8]/WIFI_SDIO_D1/J54[15] */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D1_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D1_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D1_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_SD_B1_04 (coord B15), SD1_D2/J15[1]/WIFI_SDIO_D2/J54[17] */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D2_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D2_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_SD_B1_05 (coord A16), SD1_D3/J15[2]/WIFI_SDIO_D3/J54[19] */
/* Routed pin properties */
#define BOARD_INITPINS_SD1_D3_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define BOARD_INITPINS_SD1_D3_SIGNAL                                  usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SD1_D3_CHANNEL                                         3U   /*!< Signal channel */

/* GPIO_AD_12 (coord P17), SPDIF_LOCK/J26[6]/ENET_INT/U7[21] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_RST_PERIPHERAL                                  GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_RST_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADC_RST_CHANNEL                                       11U   /*!< Signal channel */

