tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_RST_GPIO                                        GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_RST_GPIO_PIN                                      11U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADC_RST_GPIO_PIN_MASK                         (1U << 11U)   /*!< GPIO pin mask */

/* GPIO_AD_13 (coord L12), SPDIF_SR_CLK/ANATOP_32K_OUT/J26[8] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_SYNC_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_SYNC_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADC_SYNC_CHANNEL                                      12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_SYNC_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_SYNC_GPIO_PIN                                     12U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADC_SYNC_GPIO_PIN_MASK                        (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_AD_14 (coord N14), ADC_DATA_RDY */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_DATA_RDY_PERIPHERAL                             GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_DATA_RDY_SIGNAL                               gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADC_DATA_RDY_CHANNEL                                  13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_DATA_RDY_GPIO                                   GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_DATA_RDY_GPIO_PIN                                 13U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADC_DATA_RDY_GPIO_PIN_MASK                    (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_19 (coord U2), ENET_RGMII_MDC */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_MDC_PERIPHERAL                          ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_MDC_SIGNAL                              enet_mdc   /*!< Signal name */

/* GPIO_EMC_B2_00 (coord K2), SEMC_D16/U25[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_SCK_PERIPHERAL                              LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_SCK_SIGNAL                                     SCK   /*!< Signal name */

/* GPIO_EMC_B2_01 (coord K4), SEMC_D17/U25[4] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI1_PCS0_PERIPHERAL                             LPSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI1_PCS0_SIGNAL                                   PCS0   /*!< Signal name */

/* GPIO_EMC_B2_02 (coord K3), SEMC_D18/U25[5] */
/* Routed pin properties */
#define BOARD_INITPINS_BG95_PWRKEY_PERIPHERAL                              GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_BG95_PWRKEY_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BG95_PWRKEY_CHANNEL                                   12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BG95_PWRKEY_GPIO                                    GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BG95_PWRKEY_GPIO_PIN                                  12U   /*!< GPIO pin number */
#define BOARD_INITPINS_BG95_PWRKEY_GPIO_PIN_MASK                     (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_03 (coord R1), SEMC_D19/U25[7] */
/* Routed pin properties */
#define BOARD_INITPINS_BG95_RESET_PERIPHERAL                               GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_BG95_RESET_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BG95_RESET_CHANNEL                                    13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BG95_RESET_GPIO                                     GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BG95_RESET_GPIO_PIN                                   13U   /*!< GPIO pin number */
#define BOARD_INITPINS_BG95_RESET_GPIO_PIN_MASK                      (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_04 (coord M1), SEMC_D20/U25[8] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_TXD2_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_TXD2_SIGNAL                            enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_TXD2_CHANNEL                                   2U   /*!< Signal channel */

/* GPIO_EMC_B2_05 (coord N1), SEMC_D21/U25[10] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_RX_CLK_PERIPHERAL                         ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_RX_CLK_SIGNAL                         enet_rx_clk   /*!< Signal name */

/* GPIO_EMC_B2_06 (coord T1), SEMC_D22/U25[11] */
/* Routed pin properties */
#define BOARD_INITPINS_GPIO8_IO16_PERIPHERAL                               GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_GPIO8_IO16_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_GPIO8_IO16_CHANNEL                                    16U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_GPIO8_IO16_GPIO                                     GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_GPIO8_IO16_GPIO_PIN                                   16U   /*!< GPIO pin number */
#define BOARD_INITPINS_GPIO8_IO16_GPIO_PIN_MASK                      (1U << 16U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_07 (coord M3), SEMC_D23/U25[13] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_RXD3_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_RXD3_SIGNAL                            enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_RXD3_CHANNEL                                   3U   /*!< Signal channel */

/* GPIO_EMC_B2_08 (coord P1), SEMC_DM2/U25[15] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_RXD2_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_RXD2_SIGNAL                            enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_RXD2_CHANNEL                                   2U   /*!< Signal channel */

/* GPIO_EMC_B2_09 (coord N2), USER_LED_1 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_1_PERIPHERAL                               GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_1_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_1_CHANNEL                                    19U   /*!< Signal channel */

