tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_1_GPIO                                     GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_1_GPIO_PIN                                   19U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_1_GPIO_PIN_MASK                      (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_10 (coord R2), USER_LED_2 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_2_PERIPHERAL                               GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_2_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_2_CHANNEL                                    20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_2_GPIO                                     GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_2_GPIO_PIN                                   20U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_2_GPIO_PIN_MASK                      (1U << 20U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_11 (coord L4), SEMC_D26/U25[45] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_TXD0_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_TXD0_SIGNAL                            enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_TXD0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_B2_12 (coord M2), SEMC_D27/U25[47] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_TXD1_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_TXD1_SIGNAL                            enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_TXD1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_EMC_B2_13 (coord K5), SEMC_D28/U25[48] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_TX_EN_PERIPHERAL                          ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_TX_EN_SIGNAL                           enet_tx_en   /*!< Signal name */

/* GPIO_EMC_B2_14 (coord M4), SEMC_D29/U25[50] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_CLKIO_PERIPHERAL                          ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_CLKIO_SIGNAL                       enet_tx_clk_io   /*!< Signal name */

/* GPIO_EMC_B2_15 (coord L2), SEMC_D30/U25[51] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_RXD0_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_RXD0_SIGNAL                            enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_RXD0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_B2_16 (coord P2), SEMC_D31/U25[53] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_RXD1_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_RXD1_SIGNAL                            enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_RXD1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_EMC_B2_17 (coord T2), SEMC_DM3/U25[39] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_RX_EN_PERIPHERAL                          ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_RX_EN_SIGNAL                           enet_rx_en   /*!< Signal name */

/* GPIO_EMC_B2_18 (coord N3), SEMC_DQS4 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_BUTTON_PERIPHERAL                              GPIO8   /*!< Peripheral name */
#define BOARD_INITPINS_USER_BUTTON_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_BUTTON_CHANNEL                                   28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_BUTTON_GPIO                                    GPIO8   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_BUTTON_GPIO_PIN                                  28U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_BUTTON_GPIO_PIN_MASK                     (1U << 28U)   /*!< GPIO pin mask */

/* GPIO_EMC_B2_20 (coord R3), ENET_RGMII_MDIO */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_MDIO_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_MDIO_SIGNAL                             enet_mdio   /*!< Signal name */

/* GPIO_SD_B2_00 (coord J15), FlexSPI_B_D3/U21[E1] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC2_DATA3_PERIPHERAL                             USDHC2   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC2_DATA3_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SDHC2_DATA3_CHANNEL                                    3U   /*!< Signal channel */

/* GPIO_SD_B2_01 (coord J14), FlexSPI_B_D2/U21[E2] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC2_DATA2_PERIPHERAL                             USDHC2   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC2_DATA2_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SDHC2_DATA2_CHANNEL                                    2U   /*!< Signal channel */

/* GPIO_SD_B2_02 (coord H13), FlexSPI_B_D1/U21[E3] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC2_DATA1_PERIPHERAL                             USDHC2   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC2_DATA1_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SDHC2_DATA1_CHANNEL                                    1U   /*!< Signal channel */

/* GPIO_SD_B2_03 (coord E15), FlexSPI_B_D0/U21[D5] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC2_DATA0_PERIPHERAL                             USDHC2   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC2_DATA0_SIGNAL                             usdhc_data   /*!< Signal name */
#define BOARD_INITPINS_SDHC2_DATA0_CHANNEL                                    0U   /*!< Signal channel */

/* GPIO_SD_B2_04 (coord F14), FlexSPI_B_CLK/U21[B1] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC2_CLK_PERIPHERAL                               USDHC2   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC2_CLK_SIGNAL                                usdhc_clk   /*!< Signal name */

/* GPIO_SD_B2_06 (coord F17), FlexSPI_A_SS0/U23[1]/U21[C2] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_TXD3_PERIPHERAL                           ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_TXD3_SIGNAL                            enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_1G_TXD3_CHANNEL                                   3U   /*!< Signal channel */

/* GPIO_SD_B2_07 (coord G14), FlexSPI_A_CLK/U23[6]/U21[B2] */
/* Routed pin properties */
#define BOARD_INITPINS_DIG_IN_1_PERIPHERAL                                GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DIG_IN_1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIG_IN_1_CHANNEL                                      16U   /*!< Signal channel */

