tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIG_IN_1_GPIO                                      GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIG_IN_1_GPIO_PIN                                     16U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIG_IN_1_GPIO_PIN_MASK                        (1U << 16U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_08 (coord F15), FlexSPI_A_D0/U23[5]/U21[D3] */
/* Routed pin properties */
#define BOARD_INITPINS_DIG_IN_2_PERIPHERAL                                GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DIG_IN_2_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIG_IN_2_CHANNEL                                      17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIG_IN_2_GPIO                                      GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIG_IN_2_GPIO_PIN                                     17U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIG_IN_2_GPIO_PIN_MASK                        (1U << 17U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_09 (coord H15), FlexSPI_A_D1/U23[2]/U21[D2] */
/* Routed pin properties */
#define BOARD_INITPINS_DIG_IN_3_PERIPHERAL                                GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DIG_IN_3_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIG_IN_3_CHANNEL                                      18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIG_IN_3_GPIO                                      GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIG_IN_3_GPIO_PIN                                     18U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIG_IN_3_GPIO_PIN_MASK                        (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_10 (coord H14), FlexSPI_A_D2/U23[3]/U21[C4] */
/* Routed pin properties */
#define BOARD_INITPINS_DIG_IN_4_PERIPHERAL                                GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DIG_IN_4_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DIG_IN_4_CHANNEL                                      19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DIG_IN_4_GPIO                                      GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DIG_IN_4_GPIO_PIN                                     19U   /*!< GPIO pin number */
#define BOARD_INITPINS_DIG_IN_4_GPIO_PIN_MASK                        (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_SD_B2_11 (coord F16), FlexSPI_A_D3/U23[7]/U21[D4] */
/* Routed pin properties */
#define BOARD_INITPINS_RESET_ETH_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_RESET_ETH_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_RESET_ETH_CHANNEL                                     20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_RESET_ETH_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_RESET_ETH_GPIO_PIN                                    20U   /*!< GPIO pin number */
#define BOARD_INITPINS_RESET_ETH_GPIO_PIN_MASK                       (1U << 20U)   /*!< GPIO pin mask */

/* GPIO_AD_15 (coord M14), SPDIF_IN/U43[4]/BT_RST#/U16[14]/J54[54] */
/* Routed pin properties */
#define BOARD_INITPINS_DSI_LPTE_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_DSI_LPTE_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DSI_LPTE_CHANNEL                                      14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSI_LPTE_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DSI_LPTE_GPIO_PIN                                     14U   /*!< GPIO pin number */
#define BOARD_INITPINS_DSI_LPTE_GPIO_PIN_MASK                        (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_AD_16 (coord N17), SPDIF_OUT/WIFI_RST_B/U354[3] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_1G_MDC_PERIPHERAL                            ENET_1G   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_1G_MDC_SIGNAL                               enet_mdc   /*!< Signal name */

/* GPIO_AD_26 (coord L14), CSI_PWR_CTL/USER_LED_CTL2/J50[16] */
/* Routed pin properties */
#define BOARD_INITPINS_PWM2_A1_PERIPHERAL                                   PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_PWM2_A1_SIGNAL                                          A   /*!< Signal name */
#define BOARD_INITPINS_PWM2_A1_CHANNEL                                        1U   /*!< Signal channel */

/* GPIO_AD_28 (coord L17), LPSPI1_SCK/U27[6]/BT_DEV_WAKE/U354[9]/U16[39]/J10[12] */
/* Routed pin properties */
#define BOARD_INITPINS_PWM2_A2_PERIPHERAL                                   PWM2   /*!< Peripheral name */
#define BOARD_INITPINS_PWM2_A2_SIGNAL                                          A   /*!< Signal name */
#define BOARD_INITPINS_PWM2_A2_CHANNEL                                        2U   /*!< Signal channel */

/* GPIO_AD_27 (coord N16), BT_HOST_WAKE/U16[38]/BT_WAKE_B_3V3/J54[20] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_MDIO_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_MDIO_SIGNAL                            enet_mdio   /*!< Signal name */

/* GPIO_AD_29 (coord M17), LPSPI1_PCS0/U27[1]/J10[6]/J10[3]/WL_HOST_WAKE/U16[27]/WIFI_WAKE_B_3V3/U355[21] */
/* Routed pin properties */
#define BOARD_INITPINS_WLAN_PD_PERIPHERAL                                  GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_WLAN_PD_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_WLAN_PD_CHANNEL                                       28U   /*!< Signal channel */

