tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_WLAN_PD_GPIO                                        GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_WLAN_PD_GPIO_PIN                                      28U   /*!< GPIO pin number */
#define BOARD_INITPINS_WLAN_PD_GPIO_PIN_MASK                         (1U << 28U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_00 (coord E13), ENET_RGMII_RX_EN/U10[26] */
/* Routed pin properties */
#define BOARD_INITPINS_IRQ_PE_PERIPHERAL                                  GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_IRQ_PE_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_IRQ_PE_CHANNEL                                        21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_IRQ_PE_GPIO                                        GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_IRQ_PE_GPIO_PIN                                       21U   /*!< GPIO pin number */
#define BOARD_INITPINS_IRQ_PE_GPIO_PIN_MASK                          (1U << 21U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_02 (coord D11), ENET_RGMII_RXD0/U10[25] */
/* Routed pin properties */
#define BOARD_INITPINS_DSI_CTP_IRQ_PERIPHERAL                             GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_DSI_CTP_IRQ_SIGNAL                                gpio_io   /*!< Signal name */
#define BOARD_INITPINS_DSI_CTP_IRQ_CHANNEL                                   23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_DSI_CTP_IRQ_GPIO                                   GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_DSI_CTP_IRQ_GPIO_PIN                                  23U   /*!< GPIO pin number */
#define BOARD_INITPINS_DSI_CTP_IRQ_GPIO_PIN_MASK                     (1U << 23U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_03 (coord E11), ENET_RGMII_RXD1/U10[24] */
/* Routed pin properties */
#define BOARD_INITPINS_ADC_INT_PERIPHERAL                                 GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_ADC_INT_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ADC_INT_CHANNEL                                       24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ADC_INT_GPIO                                       GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ADC_INT_GPIO_PIN                                      24U   /*!< GPIO pin number */
#define BOARD_INITPINS_ADC_INT_GPIO_PIN_MASK                         (1U << 24U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_08 (coord A15), ENET_RGMII_TXD1/U10[17]/BT_CFG[2] */
/* Routed pin properties */
#define BOARD_INITPINS_BOOTCFG_2_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_BOOTCFG_2_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BOOTCFG_2_CHANNEL                                     29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOTCFG_2_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOTCFG_2_GPIO_PIN                                    29U   /*!< GPIO pin number */
#define BOARD_INITPINS_BOOTCFG_2_GPIO_PIN_MASK                       (1U << 29U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_09 (coord C13), ENET_RGMII_TXD0/U10[18]/BT_CFG[3] */
/* Routed pin properties */
#define BOARD_INITPINS_BOOTCFG_3_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_BOOTCFG_3_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BOOTCFG_3_CHANNEL                                     30U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOTCFG_3_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOTCFG_3_GPIO_PIN                                    30U   /*!< GPIO pin number */
#define BOARD_INITPINS_BOOTCFG_3_GPIO_PIN_MASK                       (1U << 30U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_10 (coord B14), ENET_RGMII_TX_EN/U10[19]/BT_CFG[4] */
/* Routed pin properties */
#define BOARD_INITPINS_BOOTCFG_4_PERIPHERAL                               GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_BOOTCFG_4_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BOOTCFG_4_CHANNEL                                     31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOTCFG_4_GPIO                                     GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOTCFG_4_GPIO_PIN                                    31U   /*!< GPIO pin number */
#define BOARD_INITPINS_BOOTCFG_4_GPIO_PIN_MASK                       (1U << 31U)   /*!< GPIO pin mask */

/* GPIO_DISP_B1_11 (coord A14), ENET_RGMII_TXC/U10[20]/BT_CFG[5] */
/* Routed pin properties */
#define BOARD_INITPINS_BOOTCFG_5_PERIPHERAL                               GPIO11   /*!< Peripheral name */
#define BOARD_INITPINS_BOOTCFG_5_SIGNAL                                  gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BOOTCFG_5_CHANNEL                                      0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOTCFG_5_GPIO                                     GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOTCFG_5_GPIO_PIN                                     0U   /*!< GPIO pin number */
#define BOARD_INITPINS_BOOTCFG_5_GPIO_PIN_MASK                        (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_DISP_B2_02 (coord E9), ENET_TXD0/U7[24]/BT_CFG[8] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_TXD0_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_TXD0_SIGNAL                           enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_TXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_DISP_B2_03 (coord D7), ENET_TXD1/U7[25]/BT_CFG[9] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_TXD1_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_TXD1_SIGNAL                           enet_tdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_TXD1_CHANNEL                                  1U   /*!< Signal channel */

/* GPIO_DISP_B2_04 (coord C7), ENET_TXEN/U7[23]/BT_CFG[10] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_TX_EN_PERIPHERAL                        ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_TX_EN_SIGNAL                          enet_tx_en   /*!< Signal name */

