tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* GPIO_DISP_B2_05 (coord C9), ENET_TX_REF_CLK/U7[9]/BT_CFG[11] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_TXCLK_PERIPHERAL                        ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_TXCLK_SIGNAL                         enet_tx_clk   /*!< Signal name */

/* GPIO_DISP_B2_06 (coord C6), ENET_RXD0/U7[16] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_RXD0_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_RXD0_SIGNAL                           enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_RXD0_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_DISP_B2_07 (coord D6), ENET_RXD1/U7[15] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_RXD1_PERIPHERAL                         ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_RXD1_SIGNAL                           enet_rdata   /*!< Signal name */
#define BOARD_INITPINS_ENET_QOS_RXD1_CHANNEL                                  1U   /*!< Signal channel */

/* GPIO_DISP_B2_08 (coord B5), ENET_CRS_DV/U7[18] */
/* Routed pin properties */
#define BOARD_INITPINS_ENET_QOS_RX_EN_PERIPHERAL                        ENET_QOS   /*!< Peripheral name */
#define BOARD_INITPINS_ENET_QOS_RX_EN_SIGNAL                          enet_rx_en   /*!< Signal name */

/* GPIO_DISP_B2_09 (coord D8), ENET_RXER/U7[20] */
/* Routed pin properties */
#define BOARD_INITPINS_BT_PD_PERIPHERAL                                   GPIO11   /*!< Peripheral name */
#define BOARD_INITPINS_BT_PD_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BT_PD_CHANNEL                                         10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BT_PD_GPIO                                         GPIO11   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BT_PD_GPIO_PIN                                        10U   /*!< GPIO pin number */
#define BOARD_INITPINS_BT_PD_GPIO_PIN_MASK                           (1U << 10U)   /*!< GPIO pin mask */

/* GPIO_DISP_B2_10 (coord D9), LPUART2_TXD/BT_UART_TXD/U354[4]/U16[2]/J25[3]/J9[4] */
/* Routed pin properties */
#define BOARD_INITPINS_LPI2C3_SCL_PERIPHERAL                              LPI2C3   /*!< Peripheral name */
#define BOARD_INITPINS_LPI2C3_SCL_SIGNAL                                     SCL   /*!< Signal name */

/* GPIO_DISP_B2_11 (coord A6), LPUART2_RXD/BT_UART_RXD/U16[3]/U355[20]/J9[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LPI2C3_SDA_PERIPHERAL                              LPI2C3   /*!< Peripheral name */
#define BOARD_INITPINS_LPI2C3_SDA_SIGNAL                                     SDA   /*!< Signal name */

/* GPIO_DISP_B2_12 (coord B6), RGMII1_PHY_INTB/U10[31]/BT_UART_CTS/U16[5]/U355[19]/J9[6] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI4_SCK_PERIPHERAL                              LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI4_SCK_SIGNAL                                     SCK   /*!< Signal name */

/* GPIO_DISP_B2_13 (coord A5), INT1_COMBO/BT_UART_RTS/U16[4]/U354[5]/ETHPHY_RST_B/U10[12] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI4_SIN_PERIPHERAL                              LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI4_SIN_SIGNAL                                     SIN   /*!< Signal name */

/* GPIO_DISP_B2_14 (coord A7), INT2_COMBO/CSI_RST_B */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI4_SOUT_PERIPHERAL                             LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI4_SOUT_SIGNAL                                   SOUT   /*!< Signal name */

/* GPIO_DISP_B2_15 (coord A4), WDOG_B/LCM_PWR_EN/J48[32] */
/* Routed pin properties */
#define BOARD_INITPINS_LPSPI4_PCS0_PERIPHERAL                             LPSPI4   /*!< Peripheral name */
#define BOARD_INITPINS_LPSPI4_PCS0_SIGNAL                                   PCS0   /*!< Signal name */

/* GPIO_LPSR_02 (coord P6), BOOT_MODE[0] */
/* Routed pin properties */
#define BOARD_INITPINS_BOOTMODE_1_PERIPHERAL                              GPIO12   /*!< Peripheral name */
#define BOARD_INITPINS_BOOTMODE_1_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BOOTMODE_1_CHANNEL                                     2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOTMODE_1_GPIO                                    GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOTMODE_1_GPIO_PIN                                    2U   /*!< GPIO pin number */
#define BOARD_INITPINS_BOOTMODE_1_GPIO_PIN_MASK                       (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_LPSR_03 (coord T7), BOOT_MODE[1] */
/* Routed pin properties */
#define BOARD_INITPINS_BOOTMODE_0_PERIPHERAL                              GPIO12   /*!< Peripheral name */
#define BOARD_INITPINS_BOOTMODE_0_SIGNAL                                 gpio_io   /*!< Signal name */
#define BOARD_INITPINS_BOOTMODE_0_CHANNEL                                     3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BOOTMODE_0_GPIO                                    GPIO12   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_BOOTMODE_0_GPIO_PIN                                    3U   /*!< GPIO pin number */
#define BOARD_INITPINS_BOOTMODE_0_GPIO_PIN_MASK                       (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_LPSR_08 (coord U8), DMIC_CLK/U41[1]/U44[1]/J50[18] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART11_TXD_PERIPHERAL                          LPUART11   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART11_TXD_SIGNAL                                   TXD   /*!< Signal name */

/* GPIO_LPSR_09 (coord P5), DMIC_DATA0/U41[5]/J50[20]/LPSPI6_CS0/J26[11] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART11_RXD_PERIPHERAL                          LPUART11   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART11_RXD_SIGNAL                                   RXD   /*!< Signal name */

