tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* GPIO_LPSR_05 (coord N8), I2C5_SCL/J48[27]/U32[17]/U34[4]/J10[20] */
/* Routed pin properties */
#define BOARD_INITPINS_I2C5_SCL_PERIPHERAL                                LPI2C5   /*!< Peripheral name */
#define BOARD_INITPINS_I2C5_SCL_SIGNAL                                       SCL   /*!< Signal name */

/* GPIO_LPSR_04 (coord N7), I2C5_SDA/J48[26]/U32[18]/U34[6]/J10[18] */
/* Routed pin properties */
#define BOARD_INITPINS_I2C5_SDA_PERIPHERAL                                LPI2C5   /*!< Peripheral name */
#define BOARD_INITPINS_I2C5_SDA_SIGNAL                                       SDA   /*!< Signal name */

/* GPIO_EMC_B1_40 (coord K1), SEMC_RDY/U14A[C8] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART6_TXD_PERIPHERAL                            LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART6_TXD_SIGNAL                                    TXD   /*!< Signal name */

/* GPIO_EMC_B1_41 (coord L1), SEMC_CSX0/U14A[C6] */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART6_RXD_PERIPHERAL                            LPUART6   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART6_RXD_SIGNAL                                    RXD   /*!< Signal name */

/* GPIO_AD_21 (coord K14), SAI1_TXD[0]/J9[9]/J62[1]/BT_PCM_TXD/U16[9]/U354[6] */
/* Routed pin properties */
#define BOARD_INITPINS_BT_PCM_TXD_PERIPHERAL                            FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_BT_PCM_TXD_SIGNAL                         FLEXSPI_A_DATA1   /*!< Signal name */

/* GPIO_AD_22 (coord K12), SAI1_TX_BCLK/J9[11]/BT_PCM_BCLK/U16[11]/U354[7]/U355[17] */
/* Routed pin properties */
#define BOARD_INITPINS_BT_PCM_BCLK_PERIPHERAL                           FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_BT_PCM_BCLK_SIGNAL                        FLEXSPI_A_DATA2   /*!< Signal name */

/* GPIO_AD_23 (coord J12), SAI1_TX_SYNC/J9[13]/BT_PCM_SYNC/U16[8]/U354[8]/U355[16] */
/* Routed pin properties */
#define BOARD_INITPINS_BT_PCM_SYNC_PERIPHERAL                           FLEXSPI1   /*!< Peripheral name */
#define BOARD_INITPINS_BT_PCM_SYNC_SIGNAL                        FLEXSPI_A_DATA3   /*!< Signal name */

/* GPIO_AD_04 (coord M13), RS485_UART_CTS / BLUETOOTH_UART_CTS */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART8_CTS_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART8_CTS_SIGNAL                            gpio_mux_io   /*!< Signal name */
#define BOARD_INITPINS_LPUART8_CTS_CHANNEL                                    3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LPUART8_CTS_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LPUART8_CTS_GPIO_PIN                                   3U   /*!< GPIO pin number */
#define BOARD_INITPINS_LPUART8_CTS_GPIO_PIN_MASK                      (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_AD_05 (coord P13), RS485_UART_RTS / BLUETOOTH_UART_RTS */
/* Routed pin properties */
#define BOARD_INITPINS_LPUART8_RTS_PERIPHERAL                              GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_LPUART8_RTS_SIGNAL                            gpio_mux_io   /*!< Signal name */
#define BOARD_INITPINS_LPUART8_RTS_CHANNEL                                    4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LPUART8_RTS_GPIO                                    GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LPUART8_RTS_GPIO_PIN                                   4U   /*!< GPIO pin number */
#define BOARD_INITPINS_LPUART8_RTS_GPIO_PIN_MASK                      (1U << 4U)   /*!< GPIO pin mask */

/* GPIO_AD_10 (coord R17), USB_OTG1_PWR/J26[2]/U26[A1] */
/* Routed pin properties */
#define BOARD_INITPINS_USB1_PWR_PERIPHERAL                                 GPIO9   /*!< Peripheral name */
#define BOARD_INITPINS_USB1_PWR_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USB1_PWR_CHANNEL                                       9U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USB1_PWR_GPIO                                       GPIO9   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USB1_PWR_GPIO_PIN                                      9U   /*!< GPIO pin number */
#define BOARD_INITPINS_USB1_PWR_GPIO_PIN_MASK                         (1U << 9U)   /*!< GPIO pin mask */

/* GPIO_AD_35 (coord G17), 1588_EVENT0_OUT/SD_PWREN_B */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC1_RESET_N_PERIPHERAL                           GPIO10   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC1_RESET_N_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SDHC1_RESET_N_CHANNEL                                  2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SDHC1_RESET_N_GPIO                                 GPIO10   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SDHC1_RESET_N_GPIO_PIN                                 2U   /*!< GPIO pin number */
#define BOARD_INITPINS_SDHC1_RESET_N_GPIO_PIN_MASK                    (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_AD_32 (coord K16), ENET_MDC/U7[12]/SD1_CD_B/J15[9] */
/* Routed pin properties */
#define BOARD_INITPINS_SDHC1_CD_N_PERIPHERAL                           CM7_GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_SDHC1_CD_N_SIGNAL                         gpio_mux_io_cm7   /*!< Signal name */
#define BOARD_INITPINS_SDHC1_CD_N_CHANNEL                                    31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SDHC1_CD_N_GPIO                                 CM7_GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SDHC1_CD_N_GPIO_PIN                                   31U   /*!< GPIO pin number */
#define BOARD_INITPINS_SDHC1_CD_N_GPIO_PIN_MASK                      (1U << 31U)   /*!< GPIO pin mask */

/* MIPI_DSI_DP1 (coord B10), MIPI_DSI_DP1/J48[9] */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI_DP1_PERIPHERAL                          DSI_HOST   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI_DP1_SIGNAL                                    DP   /*!< Signal name */
#define BOARD_INITPINS_MIPI_DSI_DP1_CHANNEL                                   1U   /*!< Signal channel */

/* MIPI_DSI_DN1 (coord A10), MIPI_DSI_DN1/J48[8] */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI_DN1_PERIPHERAL                          DSI_HOST   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI_DN1_SIGNAL                                    DN   /*!< Signal name */
#define BOARD_INITPINS_MIPI_DSI_DN1_CHANNEL                                   1U   /*!< Signal channel */

/* MIPI_DSI_CKP (coord B9), MIPI_DSI_CLKP/J48[12] */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI_CLKP_PERIPHERAL                         DSI_HOST   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI_CLKP_SIGNAL                                 CLKP   /*!< Signal name */

