tq-systems/MBa117xL.SW.MCU.BSP/examples/board/pin_mux.h
/* MIPI_DSI_CKN (coord A9), MIPI_DSI_CLKN/J48[11] */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI_CLKN_PERIPHERAL                         DSI_HOST   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI_CLKN_SIGNAL                                 CLKN   /*!< Signal name */

/* MIPI_DSI_DP0 (coord B8), MIPI_DSI_DP0/J48[6] */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI_DP0_PERIPHERAL                          DSI_HOST   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI_DP0_SIGNAL                                    DP   /*!< Signal name */
#define BOARD_INITPINS_MIPI_DSI_DP0_CHANNEL                                   0U   /*!< Signal channel */

/* MIPI_DSI_DN0 (coord A8), MIPI_DSI_DN0/J48[5] */
/* Routed pin properties */
#define BOARD_INITPINS_MIPI_DSI_DN0_PERIPHERAL                          DSI_HOST   /*!< Peripheral name */
#define BOARD_INITPINS_MIPI_DSI_DN0_SIGNAL                                    DN   /*!< Signal name */
#define BOARD_INITPINS_MIPI_DSI_DN0_CHANNEL                                   0U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
